Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.AddPathOfTravelPoints(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ}})
Takes the points represented by the server and passes them back to Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetObstacles(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Sets obstacles as an array of pairs of points each representing an obstacle segment.
obstacles:
Obstacles to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.GetObstacles
Returns an array of pairs of points each representing an obstacle segment.
Returns:
Resulting array of obstacle segments.
Since:
2020